[{"model": "admin.logentry", "pk": 1, "fields": {"action_time": "2024-09-26T22:55:33.163Z", "user": 1, "content_type": 10, "object_id": "1", "object_repr": "First Post", "action_flag": 1, "change_message": "[{\"added\": {}}]"}}, {"model": "admin.logentry", "pk": 2, "fields": {"action_time": "2024-09-26T22:56:52.921Z", "user": 1, "content_type": 10, "object_id": "2", "object_repr": "Testing post", "action_flag": 1, "change_message": "[{\"added\": {}}]"}}, {"model": "admin.logentry", "pk": 3, "fields": {"action_time": "2024-09-26T22:58:19.241Z", "user": 1, "content_type": 10, "object_id": "3", "object_repr": "Markdown Post", "action_flag": 1, "change_message": "[{\"added\": {}}]"}}, {"model": "admin.logentry", "pk": 4, "fields": {"action_time": "2024-09-26T22:59:35.747Z", "user": 1, "content_type": 10, "object_id": "4", "object_repr": "Article style posts", "action_flag": 1, "change_message": "[{\"added\": {}}]"}}, {"model": "admin.logentry", "pk": 5, "fields": {"action_time": "2024-09-26T23:00:58.724Z", "user": 1, "content_type": 10, "object_id": "5", "object_repr": "Lifestyle Blog Post Ideas", "action_flag": 1, "change_message": "[{\"added\": {}}]"}}, {"model": "auth.user", "pk": 1, "fields": {"password": "pbkdf2_sha256$720000$qdnJB8d1ey196DYnwUQGBH$vu64BuFPhsT4mMcBylsXulrsBLZ0rRDCXKrQkdwRu1Q=", "last_login": "2024-09-26T22:54:55.563Z", "is_superuser": true, "username": "root", "first_name": "", "last_name": "", "email": "", "is_staff": true, "is_active": true, "date_joined": "2024-09-26T22:54:36.024Z", "groups": [], "user_permissions": []}}, {"model": "sessions.session", "pk": "i4mkhzliqwohu08aozyzij5hw2wrs93g", "fields": {"session_data": ".eJxVjDsOwyAQRO9CHaEFGxZSpvcZEJ8lOImwZOwqyt1jJBdJNdK8N_Nmzu9bcXuj1c2JXZlgl98u-Pik2kF6-HpfeFzqts6Bd4WftPFpSfS6ne7fQfGtHGtKBEaMqKQIwaJFD0qPMKA2WmUgoNxDI6Z0EANSRqQQAVQ23g7s8wXDJzcb:1stxNv:fFWNNf_KZSrRaPfuSgpkKyMy0sKaaiA1IxVHnA1QiyI", "expire_date": "2024-10-10T22:54:55.567Z"}}, {"model": "sites.site", "pk": 1, "fields": {"domain": "example.com", "name": "example.com"}}, {"model": "taggit.tag", "pk": 1, "fields": {"name": "dastrilla", "slug": "dastrilla"}}, {"model": "taggit.tag", "pk": 2, "fields": {"name": "root", "slug": "root"}}, {"model": "taggit.tag", "pk": 3, "fields": {"name": "live", "slug": "live"}}, {"model": "taggit.tag", "pk": 4, "fields": {"name": "django", "slug": "django"}}, {"model": "taggit.tag", "pk": 5, "fields": {"name": "markdown", "slug": "markdown"}}, {"model": "taggit.tag", "pk": 6, "fields": {"name": "author", "slug": "author"}}, {"model": "taggit.tag", "pk": 7, "fields": {"name": "rules", "slug": "rules"}}, {"model": "taggit.tag", "pk": 8, "fields": {"name": "style", "slug": "style"}}, {"model": "taggit.tag", "pk": 9, "fields": {"name": "posts", "slug": "posts"}}, {"model": "taggit.tag", "pk": 10, "fields": {"name": "lifestyle", "slug": "lifestyle"}}, {"model": "taggit.taggeditem", "pk": 1, "fields": {"tag": 1, "content_type": 10, "object_id": 1}}, {"model": "taggit.taggeditem", "pk": 2, "fields": {"tag": 2, "content_type": 10, "object_id": 1}}, {"model": "taggit.taggeditem", "pk": 3, "fields": {"tag": 3, "content_type": 10, "object_id": 1}}, {"model": "taggit.taggeditem", "pk": 4, "fields": {"tag": 4, "content_type": 10, "object_id": 2}}, {"model": "taggit.taggeditem", "pk": 5, "fields": {"tag": 1, "content_type": 10, "object_id": 3}}, {"model": "taggit.taggeditem", "pk": 6, "fields": {"tag": 2, "content_type": 10, "object_id": 3}}, {"model": "taggit.taggeditem", "pk": 7, "fields": {"tag": 5, "content_type": 10, "object_id": 3}}, {"model": "taggit.taggeditem", "pk": 8, "fields": {"tag": 8, "content_type": 10, "object_id": 4}}, {"model": "taggit.taggeditem", "pk": 9, "fields": {"tag": 9, "content_type": 10, "object_id": 4}}, {"model": "taggit.taggeditem", "pk": 10, "fields": {"tag": 6, "content_type": 10, "object_id": 4}}, {"model": "taggit.taggeditem", "pk": 11, "fields": {"tag": 7, "content_type": 10, "object_id": 4}}, {"model": "taggit.taggeditem", "pk": 12, "fields": {"tag": 1, "content_type": 10, "object_id": 5}}, {"model": "taggit.taggeditem", "pk": 13, "fields": {"tag": 10, "content_type": 10, "object_id": 5}}, {"model": "blog.post", "pk": 1, "fields": {"title": "First Post", "slug": "first-post", "author": 1, "body": "This is my first post from blog", "publish": "2024-09-26T22:55:01Z", "created": "2024-09-26T22:55:33.147Z", "updated": "2024-09-26T22:55:33.147Z", "status": "PB"}}, {"model": "blog.post", "pk": 2, "fields": {"title": "Testing post", "slug": "testing-post", "author": 1, "body": "This is test post, don't worry)", "publish": "2024-09-26T22:55:35Z", "created": "2024-09-26T22:56:52.912Z", "updated": "2024-09-26T22:56:52.912Z", "status": "PB"}}, {"model": "blog.post", "pk": 3, "fields": {"title": "Markdown Post", "slug": "markdown-post", "author": 1, "body": "This is a post formatted with markdown\r\n--------------------------------------\r\n*This is emphasized* and **this is more emphasized**.\r\nHere is a list:\r\n* One\r\n* Two\r\n* Three\r\nAnd a [link to the my GitHub](https://github.com/Dastrilla).", "publish": "2024-09-26T22:57:20Z", "created": "2024-09-26T22:58:19.229Z", "updated": "2024-09-26T22:58:19.229Z", "status": "PB"}}, {"model": "blog.post", "pk": 4, "fields": {"title": "Article style posts", "slug": "article-style-posts", "author": 1, "body": "1. How-to/tutorial posts\r\n\r\nThis is one of the most popular post types and one that arguably brings the most value to the reader. The most important thing to focus on while writing it, is to give some specific information on how to do/perform/attain/reach whatever is promised in the title of the post. Videos and images work very well as additional resources for how-to posts.\r\n2. News posts\r\n\r\nTypically used by bigger blogs, leaders in a given field that have their finger on the pulse at all times. They are usually short (less than 500 words) and share an important piece of news in a given market. There are a couple of downsides if you want to make them an important part of your publishing schedule: you have to be fast (there’s nothing worse than yesterday’s news), news has a short expiration date (it’s hard to turn a news post into a piece of evergreen content), and finally, you have to be publishing them at least once a day.\r\n3. Definition posts\r\n\r\nA.k.a. Wikipedia-style post. What you basically do is choose a term that has a significant importance in your field and define it using simple language, so the term is easy to understand for someone who’s new to the topic.\r\n4. Standard list posts\r\n\r\nList post is one of the most popular post types in use today (you’re reading one right now). The basic idea is that you take a topic or a problem and you try to come up with a number of separate solutions to it. List posts are so popular because they are extremely easy to follow. Each point is usually not related to the other ones, which means that even a distracted mind can get a lot of value from the whole post. List posts are also great for bookmarking or sharing with friends—precisely because of their reader-friendly construction.\r\n5. Resource/link list posts\r\n\r\nVery similar to standard list posts. The difference is that now you’re not coming up with the content on your own, but searching for valuable information elsewhere and, in the end, sharing links to what you have found. This type of list post is very popular lately and many successful bloggers are using it as one of the most important elements of their publishing schedule. This kind of posts tend to get a lot of backlinks due to the fact that people who have been featured often like to let their readers know about that fact, so they go ahead and mention it on their blogs.\r\n6. Profile posts\r\n\r\nA profile is a post focusing on a specific person, usually someone famous or important in a given field. Profiles usually cover things like: why the person in question became famous, what’s so special about them, what they have accomplished, and what’s their history and background. There are no specific rules of creating a good profile post. You have to choose your target, find as much interesting information about them as you can, and combine it into an article.\r\n7. Case studies\r\n\r\nCase studies present a way of solving a problem based on a real-life example. They are usually constructed in a step-by-step manner presenting each step in a detailed way, and explaining why this specific solution has been chosen. Case studies usually end with a roundup of everything that has been done and present the final results.\r\n8. Problems-and-solutions posts\r\n\r\nThis is similar post type to case studies, only here, the solution doesn’t have to be one that has already been applied. It can be a description of a theoretical solution to a problem, or an idea worth considering for other people struggling with the same problem. For example, let’s look at amateur bodybuilding as a topic. One of the most common problems in that field is gaining lean (fat-free) body mass. A bodybuilder-blogger might create a post targeting this specific problem by giving a number of possible solutions, like introducing a special diet, different workout regime, different hours of sleep, and so on.\r\n9. Comparison posts\r\n\r\nEvery field has some specific characteristics or problems that can be solved by many different means. Comparison posts take two or more possible solutions and compare them to one another. Various aspects of these solutions need to be taken into account if the whole post is to be valuable. It’s also good to point out a winner at the end. Some of the things you can compare against each other are: software, books, courses, companies, etc.—even people.\r\n10. Stories\r\n\r\nThere’s nothing like a good story. Stories are ones of the most reader-friendly types of blog posts. We ñ humans ñ are used to hearing stories ever since we were children. The power of stories lies in their ability of disguising certain messages while describing seemingly unrelated situations. You can create a story about someone who wanted to do something but failed because they didn’t know the most important elements of X, where “X” is the thing you want to share with your readers… Just an example.\r\n11. Controversial posts\r\n\r\nThe truth is people like to read controversial articles even if they don’t agree with the author. That being said, not every author has enough balls to write such a thing. Interestingly enough, creating a controversial post is not that difficult. The easiest way of doing it is to pick a topic, write down your thoughts about that topic, and then sharpen them up to the point of absurd. You can use some sarcasm while doing so. Here’s an example. Instead of saying “some Internet marketing tips published online have very few possible applications in real life,” say “every Internet marketer knows nothing about real-life business”—strong, to the point, and easy to disagree with.\r\n12. Inspiring posts\r\n\r\nUsually an inspiring story about someone (hopefully, an underdog) achieving something. The main message here is “if he can do it, so can I.” The only problem is that it’s not that easy to find something interesting enough to be turned into an inspiring post.\r\n13. Research posts\r\n\r\nA step-by-step guide on how you are (or someone else is) researching a specific topic. For example, you can share how you’re doing your keyword research, or how you’re searching for a virtual assistant to hire, or how you’re doing market research to come up with a list of potential partners and competitors.\r\n14. “What others are saying” posts\r\n\r\nThis is a combination of a research post and a link list post. The main idea is to find a topic and find other people sharing their opinion on that topic. Sometimes it’s better to not pretend that you are the most knowledgeable person in a given field, but share the opinions of other experts instead. It’s the thing Napoleon Hill was famous for.\r\n15. “What if” posts\r\n\r\nA hypothetical post about something—”What would happen if X?” kind of thing. To start, choose an interesting topic, find an element that’s certain to exist in that field, and try to write a post about what might have happened if that element never existed. For example: “What if WordPress was never invented?”\r\n16. Parody posts\r\n\r\nA satirical view on a given topic. The easiest way of coming up with such a thing is to choose another publication about something, note down some of the ideas presented in it, and extend them to the point of absurd. For example, many building-a-successful-blog gurus tell you about the importance of commenting on other blogs. In response, you could write a post on “why you need to comment on 1,374 different blogs a day if you want to be successful.”", "publish": "2024-09-26T22:59:01Z", "created": "2024-09-26T22:59:35.730Z", "updated": "2024-09-26T22:59:35.730Z", "status": "PB"}}, {"model": "blog.post", "pk": 5, "fields": {"title": "Lifestyle Blog Post Ideas", "slug": "lifestyle-blog-post-ideas", "author": 1, "body": "The term lifestyle blog is one that is often mistakenly used interchangeably with “personal blog” – but they’re not the same thing. In a nutshell:\r\n\r\n    The topics on a personal blog focus on the blogger as a person. Their experiences, and their thoughts are the overall subject of the blog. Think Carry Bradshaw from Sex And The City.\r\n    A lifestyle blogger writes posts with topics that focus on the reader. They contain news stories, recommendations, and other content that focuses on the specific kind of “lifestyle” the blog is about. \r\n\r\nFor example, here’s a list of our various different lifestyle blog post ideas:\r\n\r\n    Casino & Gambling\r\n    Love, Relationships, & Dating\r\n    Parenting & Family\r\n    Weddings\r\n\r\n    Yoga\r\n    Travel\r\n    Christian\r\n    Lifestyle", "publish": "2024-09-26T23:00:14Z", "created": "2024-09-26T23:00:58.714Z", "updated": "2024-09-26T23:00:58.714Z", "status": "PB"}}]